{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100\n",
      "10\n",
      "5\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "\"\"\"1.Сортировка в обратном порядке\n",
    "Пользователь сначала вводит количество чисел, а затем вводит сами числа, ваша задача\n",
    "отсортировать введенные пользователем числа и вывести их в обратном порядке.\"\"\"\n",
    "n = int(input())\n",
    "a = [int(input()) for i in range(n)]\n",
    "a.sort()\n",
    "for i in range(n):\n",
    "    print(a[n - i - 1])\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SVO TRS 29481292\n",
      "LJPZ DME 11113283675\n"
     ]
    }
   ],
   "source": [
    "\"\"\"2.Фильтр\n",
    "Напишите программу, которая проводит первичную обработку неких сложных и\n",
    "глючных логов. Нужно удалить сочетание «%%» в начале некоторых строк и удалить\n",
    "строки, начинающиеся с «####».\n",
    "Пример:\n",
    "ввод:\n",
    "3\n",
    "SVO TRS 29481292\n",
    "%%LJPZ DME 11113283675\n",
    "###&%^^^^\n",
    "вывод:\n",
    "SVO TRS 29481292\n",
    "LJPZ DME 11113283675\"\"\"\n",
    "\n",
    "n = int(input())\n",
    "for i in range(n):\n",
    "    str = input()\n",
    "    if str.find('%%') == 0: \n",
    "        print(str[2:])\n",
    "    elif str.find('#') == 0:\n",
    "        pass\n",
    "    else:\n",
    "        print(str)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "966\n"
     ]
    }
   ],
   "source": [
    "\"\"\"3.От и до\n",
    "Напишите программу, которая считывает список чисел, а затем выводит сумму в\n",
    "диапазоне от заданного до заданного. При этом в программе не должно\n",
    "использоваться обращение к элементам по индексу.\n",
    "На первой строке вводится натуральное число N — количество чисел\n",
    "в списке.\n",
    "Далее следуют N целых чисел из списка, каждое на отдельной\n",
    "строке.\n",
    "Затем на отдельных строках следуют начальный (p) и конечный (q) номера\n",
    "элементов списка, который нужно просуммировать. Нумерация идёт с единицы.\n",
    "Гарантируется,\n",
    "что 1≤ p ≤ q ≤ N.\n",
    "Пример:\n",
    "ввод:\n",
    "5\n",
    "100\n",
    "222\n",
    "300\n",
    "444\n",
    "500\n",
    "2\n",
    "4\n",
    "вывод:\n",
    "966\"\"\"\n",
    "\n",
    "n = int(input())\n",
    "values = [int(input()) for i in range(n)]\n",
    "p = int(input())\n",
    "q = int(input())\n",
    "print()\n",
    "for i in range(n - q):\n",
    "    values.pop()\n",
    "values.reverse()\n",
    "for i in range(p - 1):\n",
    "    values.pop()\n",
    "print(sum(values))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Вдовиченко, Кац, Смирнова\n"
     ]
    }
   ],
   "source": [
    "\"\"\"4 Список отличников\n",
    "В школе №13 отличников по программированию награждают поездкой в Артек, но\n",
    "счастливых учеников может быть больше, чем свободных мест - ваша задача определить\n",
    "отличников и если их больше чем свободных мест, то отсортировать их по фамилии и\n",
    "вывести тех, кто едет.\n",
    "Напишите функцию Artek(s, n), которая принимает в качестве параметра строку,\n",
    "содержащую имена отличников и их оценку, и число - количество свободных мест. Функция\n",
    "должна печатать фамилии тех, кто едет.\n",
    "Пример: \n",
    "ввод:\n",
    "Сидоров 3, Смирнова 5, Самойкин 4, Емельянов 2, Кац 5, Вдовиченко 5, Северин 4,\n",
    "Субботкин 5\n",
    "3\n",
    "вывод:\n",
    "Вдовиченко, Кац, Смирнова\n",
    "На вход идут фамилия с оценкой через запятую, а на следующей строке кол-во свободных\n",
    "мест\"\"\"\n",
    "\n",
    "def Artek(s, n):\n",
    "    s = s.split(\", \")\n",
    "    s = list(filter(lambda x: int(x[len(x) - 1]) % 5 == 0, s))\n",
    "    s = list(map(lambda x: x.replace(\" 5\", \"\"), s))\n",
    "    s.sort()\n",
    "    s = s[:n]\n",
    "    s = \", \".join(s)\n",
    "    return s\n",
    "\n",
    "s = str(input())\n",
    "n = int(input())\n",
    "print(Artek(s, n))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Недопустимый пароль\n"
     ]
    }
   ],
   "source": [
    "\"\"\"5 Пароль (*)\n",
    "Написать программу, которая просит пользователя ввести пароль и подтвердить его (как\n",
    "при обычной регистрации). Пароль должен соответствовать следующим требованиям:\n",
    "1)В пароле должны быть буквы (Заглавные и прописные)\n",
    "2)В пароле должны быть цифры\n",
    "3)В пароле должен быть хотя бы один спец. символ @#$%&*().,-_+\n",
    "4)Длина пароля не менее 8 символов\n",
    "Вывод:\n",
    "Если пароль содержит 7 или менее символов - программа\n",
    "должна печатать \"Недопустимый пароль\".\n",
    "Если в пароле содержатся только цифры или только буквы одного\n",
    "регистра, функция должна печатать \"Ненадежный пароль\".\n",
    "Если в пароле содержатся только буквы разных регистров или буквы\n",
    "одного регистра и цифры, функция должна печатать \"Слабый пароль\".\n",
    "Если в пароле содержатся и цифры, буквы разных регистров и спец символы, то\n",
    "функция должна печатать \"Надежный пароль\".\n",
    "Напишите функцию password_level(), которая\n",
    "принимает на вход строку и определяет, является ли она надежным паролем.\"\"\"\n",
    "\n",
    "def password_level(s):\n",
    "    special = \"@#$%&*().,-_+\"\n",
    "    if len(s) < 8:\n",
    "        print(\"Недопустимый пароль\")\n",
    "    elif s.isupper() or s.islower() or s.isdigit():\n",
    "        print(\"Ненадежный пароль\")\n",
    "    else:\n",
    "        up_mark = 0\n",
    "        down_mark = 0\n",
    "        digit_mark = 0\n",
    "        special_mark = 0\n",
    "        for i in range(len(s)):\n",
    "            if s[i].isupper(): \n",
    "                up_mark = up_mark or 1\n",
    "            elif s[i].islower():\n",
    "                down_mark = down_mark or 1\n",
    "            elif s[i].isdigit():\n",
    "                digit_mark = digit_mark or 1\n",
    "            elif s[i] in special:\n",
    "                special_mark = special_mark or 1\n",
    "        if up_mark + down_mark + digit_mark + special_mark == 4:\n",
    "            print(\"Надежный пароль\")\n",
    "        else:\n",
    "            print(\"Слабый пароль\")\n",
    "   \n",
    "\n",
    "\n",
    "s = input(\"введите пароль\")\n",
    "password_level(s)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
